'-------------------------------------------------------------------------------------
' English language module for WINCONTIG
'
' Translated by:
'   Marco D'Amato (md<at>mdtzone<dot>it)
'
' Currently maintained by:
'   Marco D'Amato (md<at>mdtzone<dot>it)
'
' Last updated: Dec 18, 2014
'
' NOTE: Don't translate '\n', '\t', '%s', '%d', '$c$' and '$d$'
'
'-------------------------------------------------------------------------------------
' Language Name of the module in your native language ***
' (e.g. Italiano, Français, etc)
'-------------------------------------------------------------------------------------
LNG=English
'-------------------------------------------------------------------------------------
' Main program window - "General" Tab (misc) ***
'-------------------------------------------------------------------------------------
1=Fragmented files
2=Contiguous files
3=Defragmented files
4=Not processed files
195=CURRENT SESSION
199=Start time:
200=Action:
222=Current operation:
214=Defragmenting
215=File Defragmentation
207=File Analysis
209=Completed
211=Aborted by the user
212=Canceled
213=Analyzing...
216=Skipped all objects
219=LAST SESSION
217=General
227=Total processed files:
228=Defragmented files:
234=n/a
240=FRAGMENTED
241=CONTIGUOUS
243=DEFRAGMENTED
254=Checking volumes for errors...
257=Disk cleaning up...
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons labels ***
'-------------------------------------------------------------------------------------
17=Add
18=Remove
19=Properties
20=Load profile
21=Save profile
283=Fragments
294=View report
455=Filter
24=Defragment
25=Stop
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons tooltips ***
'-------------------------------------------------------------------------------------
473=Add
474=Add one or more files to the list. Click the arrow to add folders.
475=Remove
476=Remove the selected items from the list.
477=Properties
478=Display the properties of the selected items.
479=Fragments
480=Display additional information about the selected files, including the size and the number of fragments the files consist of.
481=Filter
482=Show the Filter dialog box to exclude or include specific files, folders and file types from analysis and defragmentation.
483=Load profile
484=Load a list of items from a previously saved profile file.
485=Save profile
486=Save the list of items into a profile file.
26=Analyze
45=Analyze the files in order to determine how fragmented they are. 
101=Defragment
139=Consolidate fragmented files to improve system performance. Click the arrow to defragment only the fragmented files selected in the lower pane.
122=Stop
136=Stop the current operation in progress.
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Add" button) ***
'-------------------------------------------------------------------------------------
65=Add &file...\tCTRL+O
66=Add f&older...\tCTRL+D
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Profile" button) ***
'-------------------------------------------------------------------------------------
155=<empty>
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Defragment" button) ***
'-------------------------------------------------------------------------------------
365=&Defragment all files
156=Defragment only &selected fragmented files
'----------------------------------------------------------------------------------------------
' Main program window - Items to be processed (Column Headers/Column Header Context Menu) ***
'----------------------------------------------------------------------------------------------
27=File name
28=Size
29=Status
30=Type
248=Fragments
249=Clusters
250=Size on disk
274=% on disk
472=Last modified date
487=Attributes
251=Default
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Status" Column) ***
'-------------------------------------------------------------------------------------
5=Fragmented
6=Not fragmented
7=Error
8=Defragmented
146=Contiguous
369=Skipped
424=Processing...
218=Skipped (filtered out)
220=Skipped (stored on SSD)
226=Aborted
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (misc) ***
'-------------------------------------------------------------------------------------
31=Add objects to defragment here.
247=Root folder
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (Context Menu) ***
'-------------------------------------------------------------------------------------
67=&Open
68=&Add object
69=&File...\tCTRL+O
70=F&older...\tCTRL+D
71=&Remove items\tDEL
371=Add to E&xcluded List
15=Analy&ze selected items
16=&Defragment selected items
72=&Load profile...
73=&Save profile As...
223=Prop&erties...
75=A&uto scroll
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Column Headers/Column Header Context Menu) ***
'--------------------------------------------------------------------------------------------------
9=Fragments
252=Clusters
253=Size on disk
10=Size
11=File name
183=Path
275=% on disk
256=Default
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (misc) ***
'-------------------------------------------------------------------------------------
144=Fragmented files
12=No fragmented files found.
428=No files have been processed yet.
'-------------------------------------------------------------------------------------
' Main program window - Tab Options ***
'-------------------------------------------------------------------------------------
187=&Show file name and path in separate columns
188=Show advanced options for the tabs.
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Context Menu) ***
'-------------------------------------------------------------------------------------
363=&Select highlighted files
364=&Deselect highlighted files
367=&Invert selection
372=Add to E&xcluded list
162=Open file l&ocation
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" listview (checkbox) tooltip ***
'--------------------------------------------------------------------------------------------------
171=Select/Deselect
161=Select or deselect all listed files.
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (Column Headers) ***
'--------------------------------------------------------------------------------------------------
128=File name
245=Path
129=Error
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (misc) ***
'--------------------------------------------------------------------------------------------------
98=Errors
145=No errors encountered while processing the files.
'-------------------------------------------------------------------------------------
' Main program window - Statusbar messages ***
'-------------------------------------------------------------------------------------
32=Idle
33=Total listed objects:
127=Object
137=Defragmenting
420=Total processed files:
'-------------------------------------------------------------------------------------
' Main program window - File menu ***
'-------------------------------------------------------------------------------------
34=&File
35=&Open
36=&Add object
37=&File...\tCTRL+O
38=Fo&lder...\tCTRL+D
39=&Remove items\tDEL
370=Add to E&xcluded List
284=Fragment infor&mation...
224=Prop&erties...
421=Sa&ve analysis report...
41=E&xit
'-------------------------------------------------------------------------------------
' Main program window - Profiles menu ***
'-------------------------------------------------------------------------------------
42=&Profiles
43=&Load profile...
44=&Save profile as...
157=&Configure Recent profiles list...
'-------------------------------------------------------------------------------------
' Main program window - Action menu ***
'-------------------------------------------------------------------------------------
46=&Action
47=A&nalyze
49=&Stop
50=&Defragment
148=Analy&ze selected items
150=D&efragment selected items
'-------------------------------------------------------------------------------------
' Main program window - View menu ***
'-------------------------------------------------------------------------------------
48=&View
51=&Toolbar
52=&Info panel
76=&Status bar
'-------------------------------------------------------------------------------------
' Main program window - Tools menu ***
'-------------------------------------------------------------------------------------
377=&Tools
470=&Manage filter...
'-------------------------------------------------------------------------------------
' Main program window - Options menu ***
'-------------------------------------------------------------------------------------
53=&Options
54=Stay o&n top
55=Select &full row
56=Show confirmation &messages
57=Do not allow &duplicate entries
58=&Close program when finished defragmenting
59=&Shutdown when finished defragmenting
229=Do not check &volumes for errors
235=D&efrag strategy
236=Qui&ck
237=&Smart
242=&Language
301=Set priori&ty
302=&High
303=&AboveNormal
304=&Normal
305=&BelowNormal
306=&Low
332=Disk clean&up
333=&Disabled
334=&Automatic
335=A&sk user
361=Show error &messages
348=Check &volumes for errors
349=&Disabled
350=&Automatic
351=A&sk user
408=Configure &highlighting...
488=Skip Solid State D&rive (SSD)
23=Disa&ble Solid State Drive (SSD) detection
102=Show st&ate icons
140=Show s&ystem icons
'-------------------------------------------------------------------------------------
' Main program window - Help menu ***
'-------------------------------------------------------------------------------------
60=&Help
61=Show &disclaimer
62=Show &command line switches
64=&About WinContig...
'-------------------------------------------------------------------------------------
' Menu Hints ***
'-------------------------------------------------------------------------------------
83=Adds files to the file list.
84=Adds a folder to the file list.
85=Removes the selected items from the list.
86=Adds the items listed in a profile to the file list.
87=Saves the items listed in the file list to a profile.
88=Quit WinContig.
89=Analyzes the items.
92=Allows you to interrupt the adding process.
93=Allows you to interrupt the analysis of the files.
110=Defragments the files.
94=Shows the main program window always on top.
95=Turns full row selection on or off.
96=Displays program information, version number and copyright.
99=Closes the program after it has completed the defragmentation process.
100=Shutdown the computer after it has completed the defragmentation process.
103=Turns scrolling of the files on or off.
104=Turns confirmation messages on or off.
105=Opens the selected files by using their associated applications.
106=Displays the command line switches accepted by WinContig.
107=Shows the disclaimer.
108=Does not allow duplicate entries in the file list.
225=Displays the properties of the selected items.
230=Does not check volumes for errors prior to defragmenting the files.
238=Defragments files without optimizing the placement of the clusters (faster).
239=Defragments files optimizing the placement of the clusters (slower).
255=Views the analysis report.
285=Displays additional file fragment information.
336=Does not delete temporary files prior to defragmenting the files.
337=Automatically deletes temporary files prior to defragmenting the files.
109=Asks user whether he wants to delete temporary files prior to defragmenting the files.
352=Does not check volumes fo errors prior to defragmenting the files.
353=Automatically checks volumes for errors prior to defragmenting the files.
354=Asks user whether he wants to check volumes for errors prior to defragmenting the files.
362=Shows error messages during the process of deleting the temporary files.
373=Adds the selected items to the Exclusion list.
471=Manages the Exclusion and Inclusion lists.
409=Changes the highlighting colors of the items.
429=Reverses which items are selected and which are not.
430=Selects the highlighted items.
431=Deselects the highlighted items.
422=Saves the analysis results.
22=Does not automatically detect Solid State Drives.
13=Does not defragment files on Solid State Drives.
82=Shows or hides the toolbar.
90=Shows or hides the info panel.
91=Shows or hides the status bar.
14=Defragments only the fragmented files selected in the lower pane.
141=Allows you to interrupt the current operation.
131=Analyzes only the items selected in the upper pane.
138=Defragments only the items selected in the upper pane.
158=Changes how many profiles are shown in the Recent profiles list.
135=Displays the state icons next to each item icon in the upper pane.
160=Displays the system icons instead of the WinContig icons next to each item.
163=Opens the folder containing the selected file.
'-------------------------------------------------------------------------------------
' Analysis Report ***
'-------------------------------------------------------------------------------------
177=Number of fragmented files
178=Number of contiguous files
179=Number of files that were not analyzed due to processing errors
182=Number of processed files
231=List of fragmented files:
232=List of files that were not analyzed:
289=Text document (*.txt)|*.txt|All Files (*.*)|*.*|
290=Save report
291=Report was saved successfully.
292=Analysis report of WinContig created:
293=File statistics
'-------------------------------------------------------------------------------------
' "Add files" dialog box ***
'-------------------------------------------------------------------------------------
111=Add file(s)
112=All files (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Add folder" dialog box ***
'-------------------------------------------------------------------------------------
113=Select the folder you want to add to the list, and then click Add folder. You can add more than one folder.
244=Add &folder
246=Add folder to the list
'-------------------------------------------------------------------------------------
' "Load profile" dialog box ***
'-------------------------------------------------------------------------------------
114=Load profile
115=Profiles of WinContig (*.wcp)|*.wcp|All files (*.*)|*.*|
'-------------------------------------------------------------------------------------
' "Save profile" dialog box ***
'-------------------------------------------------------------------------------------
116=Save profile
117=Profiles of WinContig (*.wcp)|*.wcp|All files (*.*)|*.*|
118=Profile was saved successfully.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box ***
'-------------------------------------------------------------------------------------
119=Importing profile
120=&Append
121=&Replace
123=The file list is not empty.
124=Click <b>Append<\b> to add the objects listed in the profile to the objects already in the list. Click <b>Replace<\b> to replace the objects in the list with the ones listed in the profile.
125=The file '%s' is not a valid profile of WinContig.
126=The profile specified on the command line does not exist.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box - Items don't exist ***
'-------------------------------------------------------------------------------------
40=Items
130=Importing profile
132=Cannot find some items listed in the profile. Items may have been renamed, moved or deleted.
133=List of items that were not imported:
'-------------------------------------------------------------------------------------
' "Check disk" dialog box ***
'-------------------------------------------------------------------------------------
308=Check Disk
320=Prior to starting the defragmentation process, you can check the volumes for errors. It's highly recommended that you check the integrity of the files stored on your disks prior to defragmenting the files. Double click on a disk to show its properties.
309=In the future, do not check the &volumes
310=Analyzing disk %s... please wait.
311=Stage progress:
321=Stage 1 of 3
355=Stage 2 of 3
356=Stage 3 of 3
313=Check &Disk
314=Don't C&heck disk
315=Disk error!
316=Errors found during disk checking. It's highly recommended that you close WinContig and repair any errors found.
317=Windows cannot run disk checking on CD-ROM and DVD-ROM drives.
318=WinContig has detected problems with a volume. We reccomend that you quit WinContig and correct the problem.\nAlternately, you may also continue normally.
319=Start automatically the def&ragmentation process if no problems are found
323=Show details
324=Disk has not been analyzed yet.
325=Hide details
326=Check disk process is complete
328=Scanning report:
329=No problems found on the disk.
330=Check disk for errors
331=Windows cannot check a disk attached through a network.
432=Volume
433=File system
434=Total size
435=Free space
436=% Free space
437=Unknown drive
438=Removable drive
439=Hard drive
440=Remote drive
441=Optical drive
442=RAM disk
443=Session status
444=Analyzing...
445=Complete
'-------------------------------------------------------------------------------------
' "Disk Cleanup" dialog box ***
'-------------------------------------------------------------------------------------
339=Disk Cleanup
340=Deleting temporary files
357=&Start Disk Cleanup
358=&Don't start Disk Cleanup
338=In the future, do not delete &temporary files
359=Prior to starting the defragmentation process, you can delete temporary files to recover disk space.
342=Estimating...
343=Deleting temporary files... Please wait.
344=Progress:
345=GetTempPath function failed with error %s !
346=Cannot delete temporary files because they are stored in the root folder !
347=Cannot delete temporary files because the following temporary path does not exist:\n\n%s
446=Use &WinContig to delete temporary files
181=E&mpty Recycle Bin
447=Use &external application to delete temporary files
448=Program:
449=Additional command-line switches:
450=&Browse...
451=Select program
452=Programs (*.exe)|*.exe|All files (*.*)|*.*|
453=No external application specified.
454=The external application specified does not exist !
'-------------------------------------------------------------------------------------
' "Exclusion/Inclusion List" dialog box ***
'-------------------------------------------------------------------------------------
469=Filter
381=Add fol&der...
382=Add &file...
399=Add &mask...
383=Remove &item
385=To prevent the undesired relocation of some data, you can exclude specific items from defragmentation. The files and folders listed in this window will not be analyzed and/or defragmented.
386=Manage exclusion list
387=List of excluded items:
391=Ignore files greater than (KB):
392=KB
393=MB
394=GB
456=Filter 
457=&Add mask
458=&Remove mask
459=Mask to add:
460=In order to process specific items, you can setup one or more masks. WinContig will process only the items that match the masks listed in this window. To specify multiple masks, separate each mask by a semicolon (;).
461=Manage inclusion list
462=List of included items:
463=Exclude
464=Include
'-------------------------------------------------------------------------------------
' "Mask file" dialog box ***
'-------------------------------------------------------------------------------------
400=Add mask
401=Specify one or more masks to exclude files and/or folders. To specify multiple masks, separate each mask by a semicolon (;).\n\nExample: *.dll;*.ocx;*.tmp
404=Masks cannot contain any of the following characters:\n \ / : < > | "
419=Character is not valid
405=Exclusion masks:
402=&Add
'-------------------------------------------------------------------------------------
' "Configure highlighting" dialog box ***
'-------------------------------------------------------------------------------------
410=Configure highlighting
411=Here you can configure the highlighting colors of the items. To change the color of an item, click on the corresponding colored button. To enable or disable the highlighting of an item, select or deselect the corresponding checkbox.
412=&Fragmented item
413=C&ontiguous item
414=&Defragmented item
415=E&rror
416=S&kipped item
418=F&ull Row Highlight
'-------------------------------------------------------------------------------------
' "Configure Profiles List" dialog box ***
'-------------------------------------------------------------------------------------
151=Recent profiles list
152=Configure Recent profiles list
153=Here you can configure how many profiles are shown in the profiles list.
154=Show this number of recent profiles (0-10):
134=Maximum character counts for recent profiles (40-1000):
159=Automatically remove missing recent profiles
172=Maximum character counts for recent profiles
173=Limits the number of characters displayed for each listed recent profile.
'-------------------------------------------------------------------------------------
' Warning/Error/Info messages ***
'-------------------------------------------------------------------------------------
174=Unknown error
175=Failed to dump file (infinite main loop).
176=The map of the file is empty.
180=Wrong map file detected.
147=The volume does not have a group of contiguous, free clusters that is large enough to contain the entire file.
164=Are you sure you want to remove the selected item?
165=Are you sure you want to remove the selected items?
166=Confirm
205=Cannot run WinContig on this version of the OS.
233=Cannot add '%s'.
307=Could not set the selected priority class.
360=The file '%s' cannot be deleted due to the following error:\n\n%s
374=The selected item was added to the excluded list.
375=The selected items were added to the excluded list.
376=The selected items are already on the excluded list.
465=Duplicated masks
466=One or more masks are on both the exclusion and inclusion lists. The items matching those masks will not be processed by WinContig.
467=&Close anyway
468=&Edit masks
490=SSD Detected
494=Solid State Device 
491=Solid State Devices see no performance benefit from traditional HDD defragmentation. File defragmentation causes lots of write processes and can put undue wear on specific areas of the drives. It is recommended that you do not defragment files on Solid State Devices.
492=&Defragment anyway
493=Do&n't defragment
149=There is not enough physical memory or system resources available to defragment the file.
'-------------------------------------------------------------------------------------
' General Button Captions ***
'-------------------------------------------------------------------------------------
395=&Yes
396=&No
397=OK
398=Cancel
406=&Continue
407=&Quit
142=&Close
'-------------------------------------------------------------------------------------
' File Open Error Messages ***
'-------------------------------------------------------------------------------------
167=Error: out of memory/resources. Couldn't execute!
168=Error: file not found. Couldn't execute!
169=Error: path not found. Couldn't execute!
170=Error: bad file Format. Couldn't execute!
'-------------------------------------------------------------------------------------
' "Fragmentation Details" dialog box ***
'-------------------------------------------------------------------------------------
259=Fragments
260=Name:
261=Path:
262=Type:
263=Size:
264=Size on disk:
265=Fragments:
266=Clusters:
267=Fragment information:
269=General
270=#
271=File clusters
272=Start cluster
273=End cluster
286=Size (bytes)
287=% of file
276=File has not been analyzed yet
277=This item is not a file
278=An error was encountered while attempting to analyze the file
279=This item does not exist
280=This file does not occupy any clusters
281=bytes
'-------------------------------------------------------------------------------------
' "Defragmentation Report" dialog box ***
'-------------------------------------------------------------------------------------
184=Defragmentation report
185=Information:
186=Defragmentation process is complete
189=Number of processed files:
190=Number of fragmented files:
191=Number of already contiguous files:
192=Number of defragmented files:
193=Number of files that were not defragmented due to processing errors:
423=This dialog box displays information about the files that were defragmented.
'-------------------------------------------------------------------------------------
' Shutdown dialog box ***
'-------------------------------------------------------------------------------------
194=Shutdown
196=This system will shutdown in 15 seconds.
197=OpenProcessToken Error.
198=AdjustTokenPrivileges Error.
'-------------------------------------------------------------------------------------
' About dialog box ***
'-------------------------------------------------------------------------------------
201=All rights reserved.
202=Freeware for commercial and personal use.
203=WinContig consolidates fragmented files so that each occupies a single, contiguous space on the volume.\n\nAs a result, your system can access files more efficiently.
204=About
298=Web site:
299=E-mail:
'-------------------------------------------------------------------------------------
' Crash dialog box ***
'-------------------------------------------------------------------------------------
77=Exception of WinContig
78=WinContig has stopped working
79=We must report the program has encountered an error. Please copy the exception information to the Clipboard, and send it to us:
80=Problem details
81=&Close the program
63=SSD detection may be incompatible with some specific hardware combinations. Please select "Disable Solid State Drive (SSD) detection" from the "Options" menu.
'-------------------------------------------------------------------------------------
' Disclaimer ***
'-------------------------------------------------------------------------------------
206=Disclaimer
221=Copy the text and put it on the Clipboard.
'-------------------------------------------------------------------------------------
' Command line switches ***
'-------------------------------------------------------------------------------------
208=Command line switches
389=Command line switches
390=WinContig accepts a number of optional command-line switches that you can use to control how the program operates.
'-------------------------------------------------------------------------------------
' Defragmentation/Analysis process Interrupted ***
'-------------------------------------------------------------------------------------
210=Please wait until the process of the current file is finished...
'-------------------------------------------------------------------------------------
' Disclaimer - RTF Format ***
'-------------------------------------------------------------------------------------
$d$
{\rtf1\ansi\ansicpg1252\deff0\deflang1033\deflangfe1040
\qc {\b\f0\fs24 Disclaimer}
\par\par
\pard This software and all the accompanying files are provided by the author "as is" and without any express or implied warranties, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose. In no event shall the author be liable for any damages whatsoever (including without limitation, damages for loss of business profits, loss of use or data, business interruption, loss of business information, or any other pecuniary loss) arising out of the use or inability to use this product, even if advised of the possibility of such damage. The entire risk arising out of the use or performance of this product and documentation remains with you.
\par}
$d$
'-------------------------------------------------------------------------------------
' Command line switches - RTF Format ***
'-------------------------------------------------------------------------------------
$c$
{\rtf1\ansi\ansicpg1252\deff0\deflang1040
\viewkind4\uc1\pard\lang1040\b\f0\fs16 SYNTAX\par
\b0\par
WINCONTIG.EXE [source] [/ANALYZE|/DEFRAG] [/CHKDSK:0|/CHKDSK:1|/CHKDSK:2] [/CLEAN:0|/CLEAN:1|/CLEAN:2] [/CLOSE|/CLOSEIFOK|/SHUTDOWN] [/DUP] [/FULLROW] [/HELP|/?] [/LANG:xx] [/NOGUI] [/NOINI] [/NOPROMPT] [/NOSCROLL] [/ONTOP] [/PROF:"profile"] [/QUICK]\par
\par
\b\par
IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f3\'B7\tab}{\*\pn\pnlvlblt\pnf3\pnindent360{\pntxtb\'B7}}\fi-360\li360\tx360 Switches are not case sensitive, so, for example, \b /CLOSE\b0  is the same as \b /close\b0 .\par
{\pntext\f3\'B7\tab}When using multiple switches, separate them with a blank space. For example, use the following command line to load a profile and start the file defragmentation:\par
\pard\par
\pard\fi360\b WINCONTIG.EXE /DEFRAG /PROF:"c:\\datas\\profile.wcp"\b0\par
\pard\par
\par
Below is the list of the WinContig switches.\par
\par
\pard\fi-1418\li1418\tx1418\b source\b0\tab Specifies the file or folder to be loaded in WinContig.\par
\pard\par
\pard\fi-1418\li1418\tx1418\b\tab IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 You must specify the full path of \i source\i0\par
{\pntext\f1\'B7\tab}You must enclose the full path of \i source\i0  in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the file \i personal.txt\i0  located in \i c:\\documents\i0 :\par
\par
\b WINCONTIG.EXE "c:\\documents\\personal.txt"\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /ANALYZE\b0\tab Starts automatically the analysis of the items loaded in WinContig.\par
\par
\b /CHKDSK:0\tab\b0 Disables the automatic disk checking. \par
\par
\b /CHKDSK:1\b0\tab Starts automatically the disk checking.\par
\par
\b /CHKDSK:2\b0\tab Asks the user before starting the disk checking.\par
\par
\b /CLEAN:0\tab\b0 Disables the automatic cleaning up of temporary files.\par
\par
\b /CLEAN:1\tab\b0 Starts automatically the cleaning up of temporary files.\par
\par
\b /CLEAN:2\tab\b0 Asks the user before starting the cleaning up of temporary files.\par
\par
\b /CLOSE\b0\tab Used to automatically close WinContig after it has completed the defragmentation process.\par
\par
\b /CLOSEIFOK\b0\tab Used to automatically close WinContig after it has completed the defragmentation process if all of the files have been successfully defragmented otherwise it stays open. 
If you use this switch in conjunction with the \b /NOGUI \b0 switch, WinContig will show the main window after it has completed the defragmentation process if one or more files have not been successfully defragmented.\par
\par
\b /DEFRAG\b0\tab Starts automatically the defragmentation of the items loaded in WinContig.\par
\par
\b /DUP\b0\tab Allows duplicate entries in the file list. WinContig does not allow duplicate entries in the file list as default. When using the \b /DUP\b0  switch, WinContig adds files to the file list faster. This option is useful if you want to load a very big profile faster and you are confident there are no duplicate entries in the profile.\par
\par
\b /FULLROW\b0\tab Turns full row selection on.\par
\par
\b /HELP \b0 or \b/?\b0 \tab Shows this dialog box.\par
\par
\b /LANG:\b0\i xx-XX\i0\tab Forces the language used by the user interface. \i xx-XX \i0 specifies a language, for example \i en-US \i0 represents English, while \i fr-FR \i0 represents French. 
If you specify the \b/LANG:auto \b0 switch, WinContig will use the system default UI language (if supported).\par
\par
\b /NOGUI\b0\tab Used to hide the WinContig main window during the analysis process or the defragmentation process. When using the \b /NOGUI\b0  switch, WinContig provides exit codes that indicate the level of success for a command.\par
\par
\tab\b Exit codes\b0\par
\par
\tab The following command-line exit codes are defined for WinContig.\par
\par
\tab\b 0\b0\tab Success.\par
\tab\b 1\b0\tab Invalid or missing profile.\par
\tab\b 2\b0\tab Errors found during disk checking.\par
\tab\b 3\b0\tab Not all items were defragmented successfully.\par
\tab\b 4\b0\tab Not all items were analyzed successfully.\par
\tab\b 5\b0\tab Invalid or missing item.\par
\par
\b /NOINI\b0\tab Used to suppress the writing of the "WinContig.ini" configuration file.\par
\par
\b /NOPROMPT\b0\tab Used to turn confirmation messages off.\par
\par
\b /NOSCROLL\b0\tab Turns scroll of the files off when WinContig performs an analysis process or a defragmentation process.\par
\par
\b /ONTOP\b0\tab Makes the WinContig main window topmost (above all other windows).\par
\par
\b /PROF:\b0\i "profile"\i0\tab Used to load the profile \i profile\i0 .\par
\par
\b\tab IMPORTANT NOTES\par
\b0\par
\pard{\pntext\f1\'B7\tab}{\*\pn\pnlvlblt\pnf1\pnindent360{\pntxtb\'B7}}\fi-360\li1778\tx1778 You must specify the full path of the profile\par
{\pntext\f1\'B7\tab}You must enclose the full path of the profile in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the profile \i data.wcp\i0  located in \i c:\\profiles\i0 :\par
\par
\b WINCONTIG.EXE /PROF:"c:\\profiles\\data.wcp"\par
\pard\fi-1418\li1418\tx1418\b0\par
\b /QUICK\b0\tab Used to turn off optimizations during the defragmentation process (i.e. it will not try to fill the gaps and it will not try to partially defragment the files that it's not possibile to totally defrag). This allows to complete the defragmentation process quicker.\par
\par
\b /SHUTDOWN\b0\tab Used to shutdown the computer after WinContig has completed the defragmentation process.\par
\par
}
$c$